SaiSaggam/URMA-TLR/ui/cloud/cc_ansic/dvt/platforms/pic32/data_service.X/main.c
#define THIS_IS_STACK_APPLICATION
#include "connector_app.h"

static void InitializeBoard(void);
static void InitAppConfig(void);
static void InitIDigiConfig(void);
static int get_uptime(void);
static void toggle_led(unsigned int);
connector_callback_status_t connector_callback(connector_class_id_t const class_id,
                                        connector_request_id_t const request_id,
                                        void const * const request_data,
                                        size_t const request_length,
                                        void * response_data,
                                        size_t * const response_length);


static unsigned short wOriginalAppConfigChecksum;	// Checksum of the ROM defaults for AppConfig
BYTE AN0String[8];
APP_CONFIG AppConfig;
CONNECTOR_CONFIG connector_config;

#if defined(__PIC32MX__) && defined(CONNECTOR_DATA_SERVICE)
    uint8_t buttons[2] = { SW1, SW2 };
    char * button_text[2] = { "SW1", "SW2" };
    char * button_log_proto = "%5d second uptime : %s Button Pressed.\n";
#endif

#if defined(CONNECTOR_DATA_SERVICE)
    char * content_type = "text/plain";
    char * path = "log.txt";
    char * connect_log_proto = "%5d second uptime : Connected to %s.\n";
#endif

int main(void){

    // Initialize the Board, including the Network Stack.
    InitializeBoard();

    TickInit();

    // Initialize Stack and application related NV variables into AppConfig.
    InitAppConfig();

    // Initialize iDigi variables into connector_config.
    InitIDigiConfig();

    // Initialize core stack layers (MAC, ARP, TCP, UDP) and
    // application modules (HTTP, SNMP, etc.)
    StackInit();

    DBINIT();
    DEBUG_PRINTF("Program Started.\n");
    connector_handle_t handle = NULL;
    connector_status_t status = connector_success;

    bool ip_assigned = false;
    bool initial_connect = true;
    int connect_time = 0;
    IP_ADDR cur_addr = AppConfig.MyIPAddr;

    while(1){
        StackTask();
        if(cur_addr.Val != AppConfig.MyIPAddr.Val){
            cur_addr = AppConfig.MyIPAddr;
            if(ip_assigned){
                if(connector_config.socket_fd != -1 && handle != NULL){
                    // if iDigi connection initialized and socket assigned.
                    // Terminate iDigi connection.  It will reconnect with new
                    // ip.  If it's an Auto IP, connection will fail until
                    // proper found.
                    status = connector_initiate_action(handle,
                            connector_initiate_terminate, NULL);
                    connect_time = 0;
                }
            }
            ip_assigned = true;
        }
        // Until IP Address is assigned, attempt to retrieve IP.
        if(ip_assigned){
            // Initialize iDigi Connector, if status is terminated, connection was
            // previously terminated.  Recreate.
            if(handle == NULL || status == connector_device_terminated){
                if(status == connector_device_terminated){
                    free(handle);
                }
                // Initialize iDigi Connector.
                handle = connector_init((connector_callback_t) connector_callback, NULL);
            }
            // Process next iDigi step.
            status = connector_step(handle);

            if(!connector_config.connected && connector_config.socket_fd != -1){
                // We are now connected.
                int cur_time = get_uptime();
                if(connect_time == 0){
                    connect_time = get_uptime();
                }
                else if(cur_time - 10 > connect_time){
                    // Been 10 seconds since connection established
                    // Assume discovery complete.
                    // TODO: Make this more intelligent (detect discovery complete?)
                    connector_config.connected = true;
                    # if defined(CONNECTOR_DATA_SERVICE)
                    {
                        connector_data_service_put_request_t data_service_request;
                        data_service_request.content_type = content_type;
                        data_service_request.path = path;
                        char buffer[50];
                        int time = SNTPGetUTCSeconds();
                        sprintf(buffer, connect_log_proto, time, connector_config.server_url);
                        data_service_request.context = &buffer;
                        if(!initial_connect){ // Append if this is a reconnect.
                            data_service_request.flags = CONNECTOR_DATA_PUT_APPEND;
                        }
                        status = connector_initiate_action(handle, connector_initiate_send_data, &data_service_request);
                    }
                    #endif
                    initial_connect = false;
                    connect_time = 0;
                }
            }

            #if defined(__PIC32MX__) && defined(CONNECTOR_DATA_SERVICE)
            {
                int switch_on;
                int i=0;
                while(connector_config.connected && i < 2){
                    switch_on = mPORTDReadBits(buttons[i]);
                    if(switch_on == 0){
                        connector_data_service_put_request_t data_service_request;
                        data_service_request.content_type = content_type;
                        data_service_request.path = path;
                        char buffer[50];
                        int time = SNTPGetUTCSeconds();
                        sprintf(buffer, button_log_proto, time, button_text[i]);
                        data_service_request.context = &buffer;
                        data_service_request.flags = CONNECTOR_DATA_PUT_APPEND;
                        status = connector_initiate_action(handle, connector_initiate_send_data, &data_service_request);
                        sleep(200); // sleep 200ms to prevent 1 button press being registered multiple times.
                    }
                    i++;
                }
            }
            #endif
        }
        sleep(50);
    }
}

static int get_uptime(void){
    uint32_t cur_time = TickGet() / TICKS_PER_SECOND;
    uint32_t up_time = (cur_time - connector_config.start_time);
    return up_time;
}

void sleep(unsigned int ms){
    unsigned int wait, start;

